package com.cloud.elasticsearch.entity;

import cn.hutool.json.JSON;
import cn.hutool.json.JSONObject;
import cn.hutool.json.JSONUtil;
import lombok.extern.slf4j.Slf4j;

import java.util.ArrayList;
import java.util.List;

/**
 * @author Administrator
 * @description
 */
@Slf4j
public class DataDemo {
    private static String  cityData="{{\"name\":\"东城区\",\"code\":\"110101\"},{\"name\":\"西城区\",\"code\":\"110102\"}," +
            "{\"name\":\"朝阳区\",\"code\":\"110105\"},{\"name\":\"丰台区\",\"code\":\"110106\"},{\"name\":\"石景山区\"," +
            "\"code\":\"110107\"},{\"name\":\"海淀区\",\"code\":\"110108\"},{\"name\":\"门头沟区\",\"code\":\"110109\"}," +
            "{\"name\":\"房山区\",\"code\":\"110111\"},{\"name\":\"通州区\",\"code\":\"110112\"},{\"name\":\"顺义区\"," +
            "\"code\":\"110113\"},{\"name\":\"昌平区\",\"code\":\"110114\"},{\"name\":\"大兴区\",\"code\":\"110115\"}," +
            "{\"name\":\"怀柔区\",\"code\":\"110116\"},{\"name\":\"平谷区\",\"code\":\"110117\"},{\"name\":\"密云区\"," +
            "\"code\":\"110118\"},{\"name\":\"延庆区\",\"code\":\"110119\"},{\"name\":\"和平区\",\"code\":\"120101\"}," +
            "{\"name\":\"河东区\",\"code\":\"120102\"},{\"name\":\"河西区\",\"code\":\"120103\"},{\"name\":\"南开区\"," +
            "\"code\":\"120104\"},{\"name\":\"河北区\",\"code\":\"120105\"},{\"name\":\"红桥区\",\"code\":\"120106\"}," +
            "{\"name\":\"东丽区\",\"code\":\"120110\"},{\"name\":\"西青区\",\"code\":\"120111\"},{\"name\":\"津南区\"," +
            "\"code\":\"120112\"},{\"name\":\"北辰区\",\"code\":\"120113\"},{\"name\":\"武清区\",\"code\":\"120114\"}," +
            "{\"name\":\"宝坻区\",\"code\":\"120115\"},{\"name\":\"滨海新区\",\"code\":\"120116\"},{\"name\":\"宁河区\"," +
            "\"code\":\"120117\"},{\"name\":\"静海区\",\"code\":\"120118\"},{\"name\":\"蓟州区\",\"code\":\"120119\"}," +
            "{\"name\":\"市辖区\",\"code\":\"130101\"},{\"name\":\"长安区\",\"code\":\"130102\"},{\"name\":\"桥西区\"," +
            "\"code\":\"130104\"},{\"name\":\"新华区\",\"code\":\"130105\"},{\"name\":\"井陉矿区\",\"code\":\"130107\"}," +
            "{\"name\":\"裕华区\",\"code\":\"130108\"},{\"name\":\"藁城区\",\"code\":\"130109\"},{\"name\":\"鹿泉区\"," +
            "\"code\":\"130110\"},{\"name\":\"栾城区\",\"code\":\"130111\"},{\"name\":\"井陉县\",\"code\":\"130121\"}," +
            "{\"name\":\"正定县\",\"code\":\"130123\"},{\"name\":\"行唐县\",\"code\":\"130125\"},{\"name\":\"灵寿县\"," +
            "\"code\":\"130126\"},{\"name\":\"高邑县\",\"code\":\"130127\"},{\"name\":\"深泽县\",\"code\":\"130128\"}," +
            "{\"name\":\"赞皇县\",\"code\":\"130129\"},{\"name\":\"无极县\",\"code\":\"130130\"},{\"name\":\"平山县\"," +
            "\"code\":\"130131\"},{\"name\":\"元氏县\",\"code\":\"130132\"},{\"name\":\"赵县\",\"code\":\"130133\"}," +
            "{\"name\":\"晋州市\",\"code\":\"130183\"},{\"name\":\"新乐市\",\"code\":\"130184\"},{\"name\":\"市辖区\"," +
            "\"code\":\"130201\"},{\"name\":\"路南区\",\"code\":\"130202\"},{\"name\":\"路北区\",\"code\":\"130203\"}," +
            "{\"name\":\"古冶区\",\"code\":\"130204\"},{\"name\":\"开平区\",\"code\":\"130205\"},{\"name\":\"丰南区\"," +
            "\"code\":\"130207\"},{\"name\":\"丰润区\",\"code\":\"130208\"},{\"name\":\"曹妃甸区\",\"code\":\"130209\"}," +
            "{\"name\":\"滦县\",\"code\":\"130223\"},{\"name\":\"滦南县\",\"code\":\"130224\"},{\"name\":\"乐亭县\"," +
            "\"code\":\"130225\"},{\"name\":\"迁西县\",\"code\":\"130227\"},{\"name\":\"玉田县\",\"code\":\"130229\"}," +
            "{\"name\":\"遵化市\",\"code\":\"130281\"},{\"name\":\"迁安市\",\"code\":\"130283\"},{\"name\":\"市辖区\"," +
            "\"code\":\"130301\"},{\"name\":\"海港区\",\"code\":\"130302\"},{\"name\":\"山海关区\",\"code\":\"130303\"}," +
            "{\"name\":\"北戴河区\",\"code\":\"130304\"},{\"name\":\"抚宁区\",\"code\":\"130306\"},{\"name\":\"青龙满族自治县\"," +
            "\"code\":\"130321\"},{\"name\":\"昌黎县\",\"code\":\"130322\"},{\"name\":\"卢龙县\",\"code\":\"130324\"}," +
            "{\"name\":\"市辖区\",\"code\":\"130401\"},{\"name\":\"邯山区\",\"code\":\"130402\"},{\"name\":\"丛台区\"," +
            "\"code\":\"130403\"},{\"name\":\"复兴区\",\"code\":\"130404\"},{\"name\":\"峰峰矿区\",\"code\":\"130406\"}," +
            "{\"name\":\"邯郸县\",\"code\":\"130421\"},{\"name\":\"临漳县\",\"code\":\"130423\"},{\"name\":\"成安县\"," +
            "\"code\":\"130424\"},{\"name\":\"大名县\",\"code\":\"130425\"},{\"name\":\"涉县\",\"code\":\"130426\"}," +
            "{\"name\":\"磁县\",\"code\":\"130427\"},{\"name\":\"肥乡县\",\"code\":\"130428\"},{\"name\":\"永年县\"," +
            "\"code\":\"130429\"},{\"name\":\"邱县\",\"code\":\"130430\"},{\"name\":\"鸡泽县\",\"code\":\"130431\"}," +
            "{\"name\":\"广平县\",\"code\":\"130432\"},{\"name\":\"馆陶县\",\"code\":\"130433\"},{\"name\":\"魏县\"," +
            "\"code\":\"130434\"},{\"name\":\"曲周县\",\"code\":\"130435\"},{\"name\":\"武安市\",\"code\":\"130481\"}," +
            "{\"name\":\"市辖区\",\"code\":\"130501\"},{\"name\":\"桥东区\",\"code\":\"130502\"},{\"name\":\"桥西区\"," +
            "\"code\":\"130503\"},{\"name\":\"邢台县\",\"code\":\"130521\"},{\"name\":\"临城县\",\"code\":\"130522\"}," +
            "{\"name\":\"内丘县\",\"code\":\"130523\"},{\"name\":\"柏乡县\",\"code\":\"130524\"},{\"name\":\"隆尧县\"," +
            "\"code\":\"130525\"},{\"name\":\"任县\",\"code\":\"130526\"},{\"name\":\"南和县\",\"code\":\"130527\"}," +
            "{\"name\":\"宁晋县\",\"code\":\"130528\"},{\"name\":\"巨鹿县\",\"code\":\"130529\"},{\"name\":\"新河县\"," +
            "\"code\":\"130530\"},{\"name\":\"广宗县\",\"code\":\"130531\"},{\"name\":\"平乡县\",\"code\":\"130532\"}," +
            "{\"name\":\"威县\",\"code\":\"130533\"},{\"name\":\"清河县\",\"code\":\"130534\"},{\"name\":\"临西县\"," +
            "\"code\":\"130535\"},{\"name\":\"南宫市\",\"code\":\"130581\"},{\"name\":\"沙河市\",\"code\":\"130582\"}," +
            "{\"name\":\"市辖区\",\"code\":\"130601\"},{\"name\":\"竞秀区\",\"code\":\"130602\"},{\"name\":\"莲池区\"," +
            "\"code\":\"130606\"},{\"name\":\"满城区\",\"code\":\"130607\"},{\"name\":\"清苑区\",\"code\":\"130608\"}," +
            "{\"name\":\"徐水区\",\"code\":\"130609\"},{\"name\":\"涞水县\",\"code\":\"130623\"},{\"name\":\"阜平县\"," +
            "\"code\":\"130624\"},{\"name\":\"定兴县\",\"code\":\"130626\"},{\"name\":\"唐县\",\"code\":\"130627\"}," +
            "{\"name\":\"高阳县\",\"code\":\"130628\"},{\"name\":\"容城县\",\"code\":\"130629\"},{\"name\":\"涞源县\"," +
            "\"code\":\"130630\"},{\"name\":\"望都县\",\"code\":\"130631\"},{\"name\":\"安新县\",\"code\":\"130632\"}," +
            "{\"name\":\"易县\",\"code\":\"130633\"},{\"name\":\"曲阳县\",\"code\":\"130634\"},{\"name\":\"蠡县\"," +
            "\"code\":\"130635\"},{\"name\":\"顺平县\",\"code\":\"130636\"},{\"name\":\"博野县\",\"code\":\"130637\"}," +
            "{\"name\":\"雄县\",\"code\":\"130638\"},{\"name\":\"涿州市\",\"code\":\"130681\"},{\"name\":\"安国市\"," +
            "\"code\":\"130683\"},{\"name\":\"高碑店市\",\"code\":\"130684\"},{\"name\":\"市辖区\",\"code\":\"130701\"}," +
            "{\"name\":\"桥东区\",\"code\":\"130702\"},{\"name\":\"桥西区\",\"code\":\"130703\"},{\"name\":\"宣化区\"," +
            "\"code\":\"130705\"},{\"name\":\"下花园区\",\"code\":\"130706\"},{\"name\":\"万全区\",\"code\":\"130708\"}," +
            "{\"name\":\"崇礼区\",\"code\":\"130709\"},{\"name\":\"张北县\",\"code\":\"130722\"},{\"name\":\"康保县\"," +
            "\"code\":\"130723\"},{\"name\":\"沽源县\",\"code\":\"130724\"},{\"name\":\"尚义县\",\"code\":\"130725\"}," +
            "{\"name\":\"蔚县\",\"code\":\"130726\"},{\"name\":\"阳原县\",\"code\":\"130727\"},{\"name\":\"怀安县\"," +
            "\"code\":\"130728\"},{\"name\":\"怀来县\",\"code\":\"130730\"},{\"name\":\"涿鹿县\",\"code\":\"130731\"}," +
            "{\"name\":\"赤城县\",\"code\":\"130732\"},{\"name\":\"市辖区\",\"code\":\"130801\"},{\"name\":\"双桥区\"," +
            "\"code\":\"130802\"},{\"name\":\"双滦区\",\"code\":\"130803\"},{\"name\":\"鹰手营子矿区\",\"code\":\"130804\"}," +
            "{\"name\":\"承德县\",\"code\":\"130821\"},{\"name\":\"兴隆县\",\"code\":\"130822\"},{\"name\":\"平泉县\"," +
            "\"code\":\"130823\"},{\"name\":\"滦平县\",\"code\":\"130824\"},{\"name\":\"隆化县\",\"code\":\"130825\"}," +
            "{\"name\":\"丰宁满族自治县\",\"code\":\"130826\"},{\"name\":\"宽城满族自治县\",\"code\":\"130827\"}," +
            "{\"name\":\"围场满族蒙古族自治县\",\"code\":\"130828\"},{\"name\":\"市辖区\",\"code\":\"130901\"},{\"name\":\"新华区\"," +
            "\"code\":\"130902\"},{\"name\":\"运河区\",\"code\":\"130903\"},{\"name\":\"沧县\",\"code\":\"130921\"}," +
            "{\"name\":\"青县\",\"code\":\"130922\"},{\"name\":\"东光县\",\"code\":\"130923\"},{\"name\":\"海兴县\"," +
            "\"code\":\"130924\"},{\"name\":\"盐山县\",\"code\":\"130925\"},{\"name\":\"肃宁县\",\"code\":\"130926\"}," +
            "{\"name\":\"南皮县\",\"code\":\"130927\"},{\"name\":\"吴桥县\",\"code\":\"130928\"},{\"name\":\"献县\"," +
            "\"code\":\"130929\"},{\"name\":\"孟村回族自治县\",\"code\":\"130930\"},{\"name\":\"泊头市\",\"code\":\"130981\"}," +
            "{\"name\":\"任丘市\",\"code\":\"130982\"},{\"name\":\"黄骅市\",\"code\":\"130983\"},{\"name\":\"河间市\"," +
            "\"code\":\"130984\"},{\"name\":\"市辖区\",\"code\":\"131001\"},{\"name\":\"安次区\",\"code\":\"131002\"}," +
            "{\"name\":\"广阳区\",\"code\":\"131003\"},{\"name\":\"固安县\",\"code\":\"131022\"},{\"name\":\"永清县\"," +
            "\"code\":\"131023\"},{\"name\":\"香河县\",\"code\":\"131024\"},{\"name\":\"大城县\",\"code\":\"131025\"}," +
            "{\"name\":\"文安县\",\"code\":\"131026\"},{\"name\":\"大厂回族自治县\",\"code\":\"131028\"},{\"name\":\"霸州市\"," +
            "\"code\":\"131081\"},{\"name\":\"三河市\",\"code\":\"131082\"},{\"name\":\"市辖区\",\"code\":\"131101\"}," +
            "{\"name\":\"桃城区\",\"code\":\"131102\"},{\"name\":\"冀州区\",\"code\":\"131103\"},{\"name\":\"枣强县\"," +
            "\"code\":\"131121\"},{\"name\":\"武邑县\",\"code\":\"131122\"},{\"name\":\"武强县\",\"code\":\"131123\"}," +
            "{\"name\":\"饶阳县\",\"code\":\"131124\"},{\"name\":\"安平县\",\"code\":\"131125\"},{\"name\":\"故城县\"," +
            "\"code\":\"131126\"},{\"name\":\"景县\",\"code\":\"131127\"},{\"name\":\"阜城县\",\"code\":\"131128\"}," +
            "{\"name\":\"深州市\",\"code\":\"131182\"},{\"name\":\"定州市\",\"code\":\"139001\"},{\"name\":\"辛集市\"," +
            "\"code\":\"139002\"},{\"name\":\"市辖区\",\"code\":\"140101\"},{\"name\":\"小店区\",\"code\":\"140105\"}," +
            "{\"name\":\"迎泽区\",\"code\":\"140106\"},{\"name\":\"杏花岭区\",\"code\":\"140107\"},{\"name\":\"尖草坪区\"," +
            "\"code\":\"140108\"},{\"name\":\"万柏林区\",\"code\":\"140109\"},{\"name\":\"晋源区\",\"code\":\"140110\"}," +
            "{\"name\":\"清徐县\",\"code\":\"140121\"},{\"name\":\"阳曲县\",\"code\":\"140122\"},{\"name\":\"娄烦县\"," +
            "\"code\":\"140123\"},{\"name\":\"古交市\",\"code\":\"140181\"},{\"name\":\"市辖区\",\"code\":\"140201\"}," +
            "{\"name\":\"城区\",\"code\":\"140202\"},{\"name\":\"矿区\",\"code\":\"140203\"},{\"name\":\"南郊区\"," +
            "\"code\":\"140211\"},{\"name\":\"新荣区\",\"code\":\"140212\"},{\"name\":\"阳高县\",\"code\":\"140221\"}," +
            "{\"name\":\"天镇县\",\"code\":\"140222\"},{\"name\":\"广灵县\",\"code\":\"140223\"},{\"name\":\"灵丘县\"," +
            "\"code\":\"140224\"},{\"name\":\"浑源县\",\"code\":\"140225\"},{\"name\":\"左云县\",\"code\":\"140226\"}," +
            "{\"name\":\"大同县\",\"code\":\"140227\"},{\"name\":\"市辖区\",\"code\":\"140301\"},{\"name\":\"城区\"," +
            "\"code\":\"140302\"},{\"name\":\"矿区\",\"code\":\"140303\"},{\"name\":\"郊区\",\"code\":\"140311\"}," +
            "{\"name\":\"平定县\",\"code\":\"140321\"},{\"name\":\"盂县\",\"code\":\"140322\"},{\"name\":\"市辖区\"," +
            "\"code\":\"140401\"},{\"name\":\"城区\",\"code\":\"140402\"},{\"name\":\"郊区\",\"code\":\"140411\"}," +
            "{\"name\":\"长治县\",\"code\":\"140421\"},{\"name\":\"襄垣县\",\"code\":\"140423\"},{\"name\":\"屯留县\"," +
            "\"code\":\"140424\"},{\"name\":\"平顺县\",\"code\":\"140425\"},{\"name\":\"黎城县\",\"code\":\"140426\"}," +
            "{\"name\":\"壶关县\",\"code\":\"140427\"},{\"name\":\"长子县\",\"code\":\"140428\"},{\"name\":\"武乡县\"," +
            "\"code\":\"140429\"},{\"name\":\"沁县\",\"code\":\"140430\"},{\"name\":\"沁源县\",\"code\":\"140431\"}," +
            "{\"name\":\"潞城市\",\"code\":\"140481\"},{\"name\":\"市辖区\",\"code\":\"140501\"},{\"name\":\"城区\"," +
            "\"code\":\"140502\"},{\"name\":\"沁水县\",\"code\":\"140521\"},{\"name\":\"阳城县\",\"code\":\"140522\"}," +
            "{\"name\":\"陵川县\",\"code\":\"140524\"},{\"name\":\"泽州县\",\"code\":\"140525\"},{\"name\":\"高平市\"," +
            "\"code\":\"140581\"},{\"name\":\"市辖区\",\"code\":\"140601\"},{\"name\":\"朔城区\",\"code\":\"140602\"}," +
            "{\"name\":\"平鲁区\",\"code\":\"140603\"},{\"name\":\"山阴县\",\"code\":\"140621\"},{\"name\":\"应县\"," +
            "\"code\":\"140622\"},{\"name\":\"右玉县\",\"code\":\"140623\"},{\"name\":\"怀仁县\",\"code\":\"140624\"}," +
            "{\"name\":\"市辖区\",\"code\":\"140701\"},{\"name\":\"榆次区\",\"code\":\"140702\"},{\"name\":\"榆社县\"," +
            "\"code\":\"140721\"},{\"name\":\"左权县\",\"code\":\"140722\"},{\"name\":\"和顺县\",\"code\":\"140723\"}," +
            "{\"name\":\"昔阳县\",\"code\":\"140724\"},{\"name\":\"寿阳县\",\"code\":\"140725\"},{\"name\":\"太谷县\"," +
            "\"code\":\"140726\"},{\"name\":\"祁县\",\"code\":\"140727\"},{\"name\":\"平遥县\",\"code\":\"140728\"}," +
            "{\"name\":\"灵石县\",\"code\":\"140729\"},{\"name\":\"介休市\",\"code\":\"140781\"},{\"name\":\"市辖区\"," +
            "\"code\":\"140801\"},{\"name\":\"盐湖区\",\"code\":\"140802\"},{\"name\":\"临猗县\",\"code\":\"140821\"}," +
            "{\"name\":\"万荣县\",\"code\":\"140822\"},{\"name\":\"闻喜县\",\"code\":\"140823\"},{\"name\":\"稷山县\"," +
            "\"code\":\"140824\"},{\"name\":\"新绛县\",\"code\":\"140825\"},{\"name\":\"绛县\",\"code\":\"140826\"}," +
            "{\"name\":\"垣曲县\",\"code\":\"140827\"},{\"name\":\"夏县\",\"code\":\"140828\"},{\"name\":\"平陆县\"," +
            "\"code\":\"140829\"},{\"name\":\"芮城县\",\"code\":\"140830\"},{\"name\":\"永济市\",\"code\":\"140881\"}," +
            "{\"name\":\"河津市\",\"code\":\"140882\"},{\"name\":\"市辖区\",\"code\":\"140901\"},{\"name\":\"忻府区\"," +
            "\"code\":\"140902\"},{\"name\":\"定襄县\",\"code\":\"140921\"},{\"name\":\"五台县\",\"code\":\"140922\"}," +
            "{\"name\":\"代县\",\"code\":\"140923\"},{\"name\":\"繁峙县\",\"code\":\"140924\"},{\"name\":\"宁武县\"," +
            "\"code\":\"140925\"},{\"name\":\"静乐县\",\"code\":\"140926\"},{\"name\":\"神池县\",\"code\":\"140927\"}," +
            "{\"name\":\"五寨县\",\"code\":\"140928\"},{\"name\":\"岢岚县\",\"code\":\"140929\"},{\"name\":\"河曲县\"," +
            "\"code\":\"140930\"},{\"name\":\"保德县\",\"code\":\"140931\"},{\"name\":\"偏关县\",\"code\":\"140932\"}," +
            "{\"name\":\"原平市\",\"code\":\"140981\"},{\"name\":\"市辖区\",\"code\":\"141001\"},{\"name\":\"尧都区\"," +
            "\"code\":\"141002\"},{\"name\":\"曲沃县\",\"code\":\"141021\"},{\"name\":\"翼城县\",\"code\":\"141022\"}," +
            "{\"name\":\"襄汾县\",\"code\":\"141023\"},{\"name\":\"洪洞县\",\"code\":\"141024\"},{\"name\":\"古县\"," +
            "\"code\":\"141025\"},{\"name\":\"安泽县\",\"code\":\"141026\"},{\"name\":\"浮山县\",\"code\":\"141027\"}," +
            "{\"name\":\"吉县\",\"code\":\"141028\"},{\"name\":\"乡宁县\",\"code\":\"141029\"},{\"name\":\"大宁县\"," +
            "\"code\":\"141030\"},{\"name\":\"隰县\",\"code\":\"141031\"},{\"name\":\"永和县\",\"code\":\"141032\"}," +
            "{\"name\":\"蒲县\",\"code\":\"141033\"},{\"name\":\"汾西县\",\"code\":\"141034\"},{\"name\":\"侯马市\"," +
            "\"code\":\"141081\"},{\"name\":\"霍州市\",\"code\":\"141082\"},{\"name\":\"市辖区\",\"code\":\"141101\"}," +
            "{\"name\":\"离石区\",\"code\":\"141102\"},{\"name\":\"文水县\",\"code\":\"141121\"},{\"name\":\"交城县\"," +
            "\"code\":\"141122\"},{\"name\":\"兴县\",\"code\":\"141123\"},{\"name\":\"临县\",\"code\":\"141124\"}," +
            "{\"name\":\"柳林县\",\"code\":\"141125\"},{\"name\":\"石楼县\",\"code\":\"141126\"},{\"name\":\"岚县\"," +
            "\"code\":\"141127\"},{\"name\":\"方山县\",\"code\":\"141128\"},{\"name\":\"中阳县\",\"code\":\"141129\"}," +
            "{\"name\":\"交口县\",\"code\":\"141130\"},{\"name\":\"孝义市\",\"code\":\"141181\"},{\"name\":\"汾阳市\"," +
            "\"code\":\"141182\"},{\"name\":\"市辖区\",\"code\":\"150101\"},{\"name\":\"新城区\",\"code\":\"150102\"}," +
            "{\"name\":\"回民区\",\"code\":\"150103\"},{\"name\":\"玉泉区\",\"code\":\"150104\"},{\"name\":\"赛罕区\"," +
            "\"code\":\"150105\"},{\"name\":\"土默特左旗\",\"code\":\"150121\"},{\"name\":\"托克托县\",\"code\":\"150122\"}," +
            "{\"name\":\"和林格尔县\",\"code\":\"150123\"},{\"name\":\"清水河县\",\"code\":\"150124\"},{\"name\":\"武川县\"," +
            "\"code\":\"150125\"}，{\"name\":\"市辖区\",\"code\":\"150201\"},{\"name\":\"东河区\",\"code\":\"150202\"}," +
            "{\"name\":\"昆都仑区\",\"code\":\"150203\"},{\"name\":\"青山区\",\"code\":\"150204\"},{\"name\":\"石拐区\"," +
            "\"code\":\"150205\"},{\"name\":\"白云鄂博矿区\",\"code\":\"150206\"},{\"name\":\"九原区\",\"code\":\"150207\"}," +
            "{\"name\":\"土默特右旗\",\"code\":\"150221\"},{\"name\":\"固阳县\",\"code\":\"150222\"},{\"name\":\"达尔罕茂明安联合旗\"," +
            "\"code\":\"150223\"},{\"name\":\"市辖区\",\"code\":\"150301\"},{\"name\":\"海勃湾区\",\"code\":\"150302\"}," +
            "{\"name\":\"海南区\",\"code\":\"150303\"},{\"name\":\"乌达区\",\"code\":\"150304\"},{\"name\":\"市辖区\"," +
            "\"code\":\"150401\"},{\"name\":\"红山区\",\"code\":\"150402\"},{\"name\":\"元宝山区\",\"code\":\"150403\"}," +
            "{\"name\":\"松山区\",\"code\":\"150404\"},{\"name\":\"阿鲁科尔沁旗\",\"code\":\"150421\"},{\"name\":\"巴林左旗\"," +
            "\"code\":\"150422\"},{\"name\":\"巴林右旗\",\"code\":\"150423\"},{\"name\":\"林西县\",\"code\":\"150424\"}," +
            "{\"name\":\"克什克腾旗\",\"code\":\"150425\"},{\"name\":\"翁牛特旗\",\"code\":\"150426\"},{\"name\":\"喀喇沁旗\"," +
            "\"code\":\"150428\"},{\"name\":\"宁城县\",\"code\":\"150429\"},{\"name\":\"敖汉旗\",\"code\":\"150430\"}," +
            "{\"name\":\"市辖区\",\"code\":\"150501\"},{\"name\":\"科尔沁区\",\"code\":\"150502\"},{\"name\":\"科尔沁左翼中旗\"," +
            "\"code\":\"150521\"},{\"name\":\"科尔沁左翼后旗\",\"code\":\"150522\"},{\"name\":\"开鲁县\",\"code\":\"150523\"}," +
            "{\"name\":\"库伦旗\",\"code\":\"150524\"},{\"name\":\"奈曼旗\",\"code\":\"150525\"},{\"name\":\"扎鲁特旗\"," +
            "\"code\":\"150526\"},{\"name\":\"霍林郭勒市\",\"code\":\"150581\"},{\"name\":\"市辖区\",\"code\":\"150601\"}," +
            "{\"name\":\"东胜区\",\"code\":\"150602\"},{\"name\":\"康巴什区\",\"code\":\"150603\"},{\"name\":\"达拉特旗\"," +
            "\"code\":\"150621\"},{\"name\":\"准格尔旗\",\"code\":\"150622\"},{\"name\":\"鄂托克前旗\",\"code\":\"150623\"}," +
            "{\"name\":\"鄂托克旗\",\"code\":\"150624\"},{\"name\":\"杭锦旗\",\"code\":\"150625\"},{\"name\":\"乌审旗\"," +
            "\"code\":\"150626\"},{\"name\":\"伊金霍洛旗\",\"code\":\"150627\"},{\"name\":\"市辖区\",\"code\":\"150701\"}," +
            "{\"name\":\"海拉尔区\",\"code\":\"150702\"},{\"name\":\"扎赉诺尔区\",\"code\":\"150703\"},{\"name\":\"阿荣旗\"," +
            "\"code\":\"150721\"},{\"name\":\"莫力达瓦达斡尔族自治旗\",\"code\":\"150722\"},{\"name\":\"鄂伦春自治旗\"," +
            "\"code\":\"150723\"},{\"name\":\"鄂温克族自治旗\",\"code\":\"150724\"},{\"name\":\"陈巴尔虎旗\"," +
            "\"code\":\"150725\"},{\"name\":\"新巴尔虎左旗\",\"code\":\"150726\"},{\"name\":\"新巴尔虎右旗\"," +
            "\"code\":\"150727\"},{\"name\":\"满洲里市\",\"code\":\"150781\"},{\"name\":\"牙克石市\",\"code\":\"150782\"}," +
            "{\"name\":\"扎兰屯市\",\"code\":\"150783\"},{\"name\":\"额尔古纳市\",\"code\":\"150784\"},{\"name\":\"根河市\"," +
            "\"code\":\"150785\"},{\"name\":\"市辖区\",\"code\":\"150801\"},{\"name\":\"临河区\",\"code\":\"150802\"}," +
            "{\"name\":\"五原县\",\"code\":\"150821\"},{\"name\":\"磴口县\",\"code\":\"150822\"},{\"name\":\"乌拉特前旗\"," +
            "\"code\":\"150823\"},{\"name\":\"乌拉特中旗\",\"code\":\"150824\"},{\"name\":\"乌拉特后旗\",\"code\":\"150825\"}," +
            "{\"name\":\"杭锦后旗\",\"code\":\"150826\"},{\"name\":\"市辖区\",\"code\":\"150901\"},{\"name\":\"集宁区\"," +
            "\"code\":\"150902\"},{\"name\":\"卓资县\",\"code\":\"150921\"},{\"name\":\"化德县\",\"code\":\"150922\"}," +
            "{\"name\":\"商都县\",\"code\":\"150923\"},{\"name\":\"兴和县\",\"code\":\"150924\"},{\"name\":\"凉城县\"," +
            "\"code\":\"150925\"},{\"name\":\"察哈尔右翼前旗\",\"code\":\"150926\"},{\"name\":\"察哈尔右翼中旗\"," +
            "\"code\":\"150927\"},{\"name\":\"察哈尔右翼后旗\",\"code\":\"150928\"},{\"name\":\"四子王旗\",\"code\":\"150929\"}," +
            "{\"name\":\"丰镇市\",\"code\":\"150981\"},{\"name\":\"乌兰浩特市\",\"code\":\"152201\"},{\"name\":\"阿尔山市\"," +
            "\"code\":\"152202\"},{\"name\":\"科尔沁右翼前旗\",\"code\":\"152221\"},{\"name\":\"科尔沁右翼中旗\"," +
            "\"code\":\"152222\"},{\"name\":\"扎赉特旗\",\"code\":\"152223\"},{\"name\":\"突泉县\",\"code\":\"152224\"}," +
            "{\"name\":\"二连浩特市\",\"code\":\"152501\"},{\"name\":\"锡林浩特市\",\"code\":\"152502\"},{\"name\":\"阿巴嘎旗\"," +
            "\"code\":\"152522\"},{\"name\":\"苏尼特左旗\",\"code\":\"152523\"},{\"name\":\"苏尼特右旗\",\"code\":\"152524\"}," +
            "{\"name\":\"东乌珠穆沁旗\",\"code\":\"152525\"},{\"name\":\"西乌珠穆沁旗\",\"code\":\"152526\"},{\"name\":\"太仆寺旗\"," +
            "\"code\":\"152527\"},{\"name\":\"镶黄旗\",\"code\":\"152528\"},{\"name\":\"正镶白旗\",\"code\":\"152529\"}," +
            "{\"name\":\"正蓝旗\",\"code\":\"152530\"},{\"name\":\"多伦县\",\"code\":\"152531\"},{\"name\":\"阿拉善左旗\"," +
            "\"code\":\"152921\"},{\"name\":\"阿拉善右旗\",\"code\":\"152922\"},{\"name\":\"额济纳旗\",\"code\":\"152923\"}," +
            "{\"name\":\"市辖区\",\"code\":\"210101\"},{\"name\":\"和平区\",\"code\":\"210102\"},{\"name\":\"沈河区\"," +
            "\"code\":\"210103\"},{\"name\":\"大东区\",\"code\":\"210104\"},{\"name\":\"皇姑区\",\"code\":\"210105\"}," +
            "{\"name\":\"铁西区\",\"code\":\"210106\"},{\"name\":\"苏家屯区\",\"code\":\"210111\"},{\"name\":\"浑南区\"," +
            "\"code\":\"210112\"},{\"name\":\"沈北新区\",\"code\":\"210113\"},{\"name\":\"于洪区\",\"code\":\"210114\"}," +
            "{\"name\":\"辽中区\",\"code\":\"210115\"},{\"name\":\"康平县\",\"code\":\"210123\"},{\"name\":\"法库县\"," +
            "\"code\":\"210124\"},{\"name\":\"新民市\",\"code\":\"210181\"},{\"name\":\"市辖区\",\"code\":\"210201\"}," +
            "{\"name\":\"中山区\",\"code\":\"210202\"},{\"name\":\"西岗区\",\"code\":\"210203\"},{\"name\":\"沙河口区\"," +
            "\"code\":\"210204\"},{\"name\":\"甘井子区\",\"code\":\"210211\"},{\"name\":\"旅顺口区\",\"code\":\"210212\"}," +
            "{\"name\":\"金州区\",\"code\":\"210213\"},{\"name\":\"普兰店区\",\"code\":\"210214\"},{\"name\":\"长海县\"," +
            "\"code\":\"210224\"},{\"name\":\"瓦房店市\",\"code\":\"210281\"},{\"name\":\"庄河市\",\"code\":\"210283\"}," +
            "{\"name\":\"市辖区\",\"code\":\"210301\"},{\"name\":\"铁东区\",\"code\":\"210302\"},{\"name\":\"铁西区\"," +
            "\"code\":\"210303\"},{\"name\":\"立山区\",\"code\":\"210304\"},{\"name\":\"千山区\",\"code\":\"210311\"}," +
            "{\"name\":\"台安县\",\"code\":\"210321\"},{\"name\":\"岫岩满族自治县\",\"code\":\"210323\"},{\"name\":\"海城市\"," +
            "\"code\":\"210381\"},{\"name\":\"市辖区\",\"code\":\"210401\"},{\"name\":\"新抚区\",\"code\":\"210402\"}," +
            "{\"name\":\"东洲区\",\"code\":\"210403\"},{\"name\":\"望花区\",\"code\":\"210404\"},{\"name\":\"顺城区\"," +
            "\"code\":\"210411\"},{\"name\":\"抚顺县\",\"code\":\"210421\"},{\"name\":\"新宾满族自治县\",\"code\":\"210422\"}," +
            "{\"name\":\"清原满族自治县\",\"code\":\"210423\"},{\"name\":\"市辖区\",\"code\":\"210501\"},{\"name\":\"平山区\"," +
            "\"code\":\"210502\"},{\"name\":\"溪湖区\",\"code\":\"210503\"},{\"name\":\"明山区\",\"code\":\"210504\"}," +
            "{\"name\":\"南芬区\",\"code\":\"210505\"},{\"name\":\"本溪满族自治县\",\"code\":\"210521\"},{\"name\":\"桓仁满族自治县\"," +
            "\"code\":\"210522\"},{\"name\":\"市辖区\",\"code\":\"210601\"},{\"name\":\"元宝区\",\"code\":\"210602\"}," +
            "{\"name\":\"振兴区\",\"code\":\"210603\"},{\"name\":\"振安区\",\"code\":\"210604\"},{\"name\":\"宽甸满族自治县\"," +
            "\"code\":\"210624\"},{\"name\":\"东港市\",\"code\":\"210681\"},{\"name\":\"凤城市\",\"code\":\"210682\"}," +
            "{\"name\":\"市辖区\",\"code\":\"210701\"},{\"name\":\"古塔区\",\"code\":\"210702\"},{\"name\":\"凌河区\"," +
            "\"code\":\"210703\"},{\"name\":\"太和区\",\"code\":\"210711\"},{\"name\":\"黑山县\",\"code\":\"210726\"}," +
            "{\"name\":\"义县\",\"code\":\"210727\"},{\"name\":\"凌海市\",\"code\":\"210781\"},{\"name\":\"北镇市\"," +
            "\"code\":\"210782\"},{\"name\":\"市辖区\",\"code\":\"210801\"},{\"name\":\"站前区\",\"code\":\"210802\"}," +
            "{\"name\":\"西市区\",\"code\":\"210803\"},{\"name\":\"鲅鱼圈区\",\"code\":\"210804\"},{\"name\":\"老边区\"," +
            "\"code\":\"210811\"},{\"name\":\"盖州市\",\"code\":\"210881\"},{\"name\":\"大石桥市\",\"code\":\"210882\"}," +
            "{\"name\":\"市辖区\",\"code\":\"210901\"},{\"name\":\"海州区\",\"code\":\"210902\"},{\"name\":\"新邱区\"," +
            "\"code\":\"210903\"},{\"name\":\"太平区\",\"code\":\"210904\"},{\"name\":\"清河门区\",\"code\":\"210905\"}," +
            "{\"name\":\"细河区\",\"code\":\"210911\"},{\"name\":\"阜新蒙古族自治县\",\"code\":\"210921\"},{\"name\":\"彰武县\"," +
            "\"code\":\"210922\"},{\"name\":\"市辖区\",\"code\":\"211001\"},{\"name\":\"白塔区\",\"code\":\"211002\"}," +
            "{\"name\":\"文圣区\",\"code\":\"211003\"},{\"name\":\"宏伟区\",\"code\":\"211004\"},{\"name\":\"弓长岭区\"," +
            "\"code\":\"211005\"},{\"name\":\"太子河区\",\"code\":\"211011\"},{\"name\":\"辽阳县\",\"code\":\"211021\"}," +
            "{\"name\":\"灯塔市\",\"code\":\"211081\"},{\"name\":\"市辖区\",\"code\":\"211101\"},{\"name\":\"双台子区\"," +
            "\"code\":\"211102\"},{\"name\":\"兴隆台区\",\"code\":\"211103\"},{\"name\":\"大洼区\",\"code\":\"211104\"}," +
            "{\"name\":\"盘山县\",\"code\":\"211122\"},{\"name\":\"市辖区\",\"code\":\"211201\"},{\"name\":\"银州区\"," +
            "\"code\":\"211202\"},{\"name\":\"清河区\",\"code\":\"211204\"},{\"name\":\"铁岭县\",\"code\":\"211221\"}," +
            "{\"name\":\"西丰县\",\"code\":\"211223\"},{\"name\":\"昌图县\",\"code\":\"211224\"},{\"name\":\"调兵山市\"," +
            "\"code\":\"211281\"},{\"name\":\"开原市\",\"code\":\"211282\"},{\"name\":\"市辖区\",\"code\":\"211301\"}," +
            "{\"name\":\"双塔区\",\"code\":\"211302\"},{\"name\":\"龙城区\",\"code\":\"211303\"},{\"name\":\"朝阳县\"," +
            "\"code\":\"211321\"},{\"name\":\"建平县\",\"code\":\"211322\"},{\"name\":\"喀喇沁左翼蒙古族自治县\"," +
            "\"code\":\"211324\"},{\"name\":\"北票市\",\"code\":\"211381\"},{\"name\":\"凌源市\",\"code\":\"211382\"}," +
            "{\"name\":\"市辖区\",\"code\":\"211401\"},{\"name\":\"连山区\",\"code\":\"211402\"},{\"name\":\"龙港区\"," +
            "\"code\":\"211403\"},{\"name\":\"南票区\",\"code\":\"211404\"},{\"name\":\"绥中县\",\"code\":\"211421\"}," +
            "{\"name\":\"建昌县\",\"code\":\"211422\"},{\"name\":\"兴城市\",\"code\":\"211481\"}}";
    private static String cityOnly="\"郑州市\",\"洛阳市\",\"焦作市\",\"商丘市\",\"信阳市\",\"周口市\",\"鹤壁市\",\"安阳市\",\"濮阳市\"," +
            "\"驻马店市\",\"南阳市\",\"开封市\",\"漯河市\",\"许昌市\",\"新乡市\",\"济源市\",\"灵宝市\",\"偃师市\",\"邓州市\",\"登封市\",\"三门峡市\"," +
            "\"新郑市\",\"禹州市\",\"巩义市\",\"永城市\",\"长葛市\",\"义马市\",\"林州市\",\"项城市\",\"汝州市\",\"荥阳市\",\"平顶山市\",\"卫辉市\"," +
            "\"辉县市\",\"舞钢市\",\"新密市\",\"孟州市\",\"沁阳市\",\"郏县\",\"安徽省\",\"合肥市\",\"亳州市\",\"芜湖市\",\"马鞍山市\",\"池州市\",\"黄山市\"," +
            "\"滁州市\",\"安庆市\",\"淮南市\",\"淮北市\",\"蚌埠市\",\"宿州市\",\"宣城市\",\"六安市\",\"阜阳市\",\"铜陵市\",\"明光市\",\"天长市\",\"宁国市\"," +
            "\"界首市\",\"桐城市\",\"潜山市\",\"福建省\",\"福州市\",\"厦门市\",\"泉州市\",\"漳州市\",\"南平市\",\"三明市\",\"龙岩市\",\"莆田市\",\"宁德市\"," +
            "\"龙海市\",\"建瓯市\",\"武夷山市\",\"长乐市\",\"福清市\",\"晋江市\",\"南安市\",\"福安市\",\"邵武市\",\"石狮市\",\"福鼎市\",\"建阳市\"," +
            "\"漳平市\",\"永安市\",\"甘肃省\",\"兰州市\",\"白银市\",\"武威市\",\"金昌市\",\"平凉市\",\"张掖市\",\"嘉峪关市\",\"酒泉市\",\"庆阳市\"," +
            "\"定西市\",\"陇南市\",\"天水市\",\"玉门市\",\"临夏市\",\"合作市\",\"敦煌市\",\"甘南州\",\"贵州省\",\"贵阳市\",\"安顺市\",\"遵义市\"," +
            "\"六盘水市\",\"兴义市\",\"都匀市\",\"凯里市\",\"毕节市\",\"清镇市\",\"铜仁市\",\"赤水市\",\"仁怀市\",\"福泉市\",\"海南省\",\"海口市\"," +
            "\"三亚市\",\"万宁市\",\"文昌市\",\"儋州市\",\"琼海市\",\"东方市\",\"五指山市\",\"河北省\",\"石家庄市\",\"保定市\",\"唐山市\",\"邯郸市\"," +
            "\"邢台市\",\"沧州市\",\"衡水市\",\"廊坊市\",\"承德市\",\"迁安市\",\"鹿泉市\",\"秦皇岛市\",\"南宫市\",\"任丘市\",\"叶城市\",\"辛集市\"," +
            "\"涿州市\",\"定州市\",\"晋州市\",\"霸州市\",\"黄骅市\",\"遵化市\",\"张家口市\",\"沙河市\",\"三河市\",\"冀州市\",\"武安市\",\"河间市\"," +
            "\"深州市\",\"新乐市\",\"泊头市\",\"安国市\",\"双滦区\",\"高碑店市\",\"黑龙江省\",\"哈尔滨市\",\"伊春市\",\"牡丹江市\",\"大庆市\",\"鸡西市\"," +
            "\"鹤岗市\",\"绥化市\",\"齐齐哈尔市\",\"黑河市\",\"富锦市\",\"虎林市\",\"密山市\",\"佳木斯市\",\"双鸭山市\",\"海林市\",\"铁力市\",\"北安市\"," +
            "\"五大连池市\",\"阿城市\",\"尚志市\",\"五常市\",\"安达市\",\"七台河市\",\"绥芬河市\",\"双城市\",\"海伦市\",\"宁安市\",\"讷河市\",\"穆棱市\"," +
            "\"同江市\",\"肇东市\",\"湖北省\",\"武汉市\",\"荆门市\",\"咸宁市\",\"襄阳市\",\"荆州市\",\"黄石市\",\"宜昌市\",\"随州市\",\"鄂州市\",\"孝感市\"," +
            "\"黄冈市\",\"十堰市\",\"枣阳市\",\"老河口市\",\"恩施市\",\"仙桃市\",\"天门市\",\"钟祥市\",\"潜江市\",\"麻城市\",\"洪湖市\",\"汉川市\"," +
            "\"赤壁市\",\"松滋市\",\"丹江口市\",\"武穴市\",\"广水市\",\"石首市大冶市\",\"枝江市\",\"应城市\",\"宜城市\",\"当阳市\",\"安陆市\",\"宜都市\"," +
            "\"利川市\",\"湖南省\",\"长沙市\",\"郴州市\",\"益阳市\",\"娄底市\",\"株洲市\",\"衡阳市\",\"湘潭市\",\"岳阳市\",\"常德市\",\"邵阳市\",\"永州市\"," +
            "\"张家界市\",\"怀化市\",\"浏阳市\",\"醴陵市\",\"湘乡市\",\"耒阳市\",\"沅江市\",\"涟源市\",\"常宁市\",\"吉首市\",\"津市市\",\"冷水江市\"," +
            "\"临湘市\",\"汨罗市\",\"武冈市\",\"韶山市\",\"湘西州\",\"吉林省\",\"长春市\",\"吉林市\",\"通化市\",\"白城市\",\"四平市\",\"辽源市\",\"松原市\"," +
            "\"白山市\",\"集安市\",\"梅河口市\",\"双辽市\",\"延吉市\",\"九台市\",\"桦甸市\",\"榆树市\",\"蛟河市\",\"磐石市\",\"大安市\",\"德惠市\"," +
            "\"洮南市\",\"龙井市\",\"珲春市\",\"公主岭市\",\"图们市\",\"舒兰市\",\"和龙市\",\"临江市\",\"敦化市\",\"江苏省\",\"南京市\",\"无锡市\"," +
            "\"常州市\",\"扬州市\",\"徐州市\",\"苏州市\",\"连云港市\",\"盐城市\",\"淮安市\",\"宿迁市\",\"镇江市\",\"南通市\",\"泰州市\",\"兴化市\"," +
            "\"东台市\",\"常熟市\",\"江阴市\",\"张家港市\",\"通州市\",\"宜兴市\",\"邳州市\",\"海门市\",\"溧阳市\",\"泰兴市\",\"如皋市\",\"昆山市\"," +
            "\"启东市\",\"江都市\",\"丹阳市\",\"吴江市\",\"靖江市\",\"扬中市\",\"新沂市\",\"仪征市\",\"太仓市\",\"姜堰市\",\"高邮市\",\"金坛市\",\"句容市\"," +
            "\"灌南县\",\"海安市\",\"江西省\",\"南昌市\",\"赣州市\",\"上饶市\",\"宜春市\",\"景德镇市\",\"新余市\",\"九江市\",\"萍乡市\",\"抚州市\"," +
            "\"鹰潭市\",\"吉安市\",\"丰城市\",\"樟树市\",\"德兴市\",\"瑞金市\",\"井冈山市\",\"共青城市\",\"[1]\",\"\",\"高安市\",\"乐平市\",\"南康市\"," +
            "\"贵溪市\",\"瑞昌市\",\"东乡县\",\"广丰县\",\"信州区\",\"三清山\",\"辽宁省\",\"沈阳市\",\"葫芦岛市\",\"大连市\",\"盘锦市\",\"鞍山市\"," +
            "\"铁岭市\",\"本溪市\",\"丹东市\",\"抚顺市\",\"锦州市\",\"辽阳市\",\"阜新市\",\"调兵山市\",\"朝阳市\",\"海城市\",\"北票市\",\"盖州市\"," +
            "\"凤城市\",\"庄河市\",\"凌源市\",\"开原市\",\"兴城市\",\"新民市\",\"大石桥市\",\"东港市\",\"北宁市\",\"瓦房店市\",\"凌海市\",\"灯塔市\"," +
            "\"营口市\",\"青海省\",\"西宁市\",\"海东市\",\"玉树市\",\"格尔木市\",\"德令哈市\",\"山东省\",\"济南市\",\"青岛市\",\"威海市\",\"潍坊市\"," +
            "\"菏泽市\",\"济宁市\",\"东营市\",\"烟台市\",\"淄博市\",\"枣庄市\",\"泰安市\",\"临沂市\",\"日照市\",\"德州市\",\"聊城市\",\"滨州市\",\"乐陵市\"," +
            "\"兖州市\",\"诸城市\",\"邹城市\",\"滕州市\",\"肥城市\",\"新泰市\",\"胶州市\",\"胶南市\",\"龙口市\",\"平度市\",\"莱西市\",\"山西省\",\"太原市\"," +
            "\"大同市\",\"阳泉市\",\"长治市\",\"临汾市\",\"晋中市\",\"运城市\",\"忻州市\",\"朔州市\",\"吕梁市\",\"古交市\",\"高平市\",\"永济市\",\"孝义市\"," +
            "\"侯马市\",\"霍州市\",\"介休市\",\"河津市\",\"汾阳市\",\"原平市\",\"晋城市\",\"潞城市\",\"陕西省\",\"西安市\",\"咸阳市\",\"榆林市\",\"宝鸡市\"," +
            "\"铜川市\",\"渭南市\",\"汉中市\",\"安康市\",\"商洛市\",\"延安市\",\"韩城市\",\"兴平市\",\"华阴市\",\"四川省\",\"成都市\",\"广安市\",\"德阳市\"," +
            "\"乐山市\",\"巴中市\",\"内江市\",\"宜宾市\",\"南充市\",\"都江堰市\",\"自贡市\",\"泸州市\",\"广元市达州市\",\"资阳市\",\"绵阳市\",\"眉山市\"," +
            "\"遂宁市\",\"雅安市\",\"阆中市\",\"攀枝花市\",\"广汉市\",\"绵竹市\",\"万源市\",\"华蓥市\",\"江油市\",\"西昌市\",\"彭州市\",\"简阳市\"," +
            "\"崇州市\",\"什邡市\",\"峨眉山市\",\"邛崃市\",\"云南省\",\"昆明市\",\"玉溪市\",\"大理市\",\"曲靖市\",\"昭通市\",\"保山市\",\"丽江市\"," +
            "\"临沧市\",\"楚雄市\",\"开远市\",\"个旧市\",\"景洪市\",\"安宁市\",\"宣威市\",\"文山市\",\"普洱市\",\"浙江省\",\"杭州市\",\"宁波市\",\"绍兴市\"," +
            "\"温州市\",\"台州市\",\"湖州市\",\"嘉兴市\",\"金华市\",\"舟山市\",\"衢州市\",\"丽水市\",\"余姚市\",\"乐清市\",\"临海市\",\"温岭市\",\"永康市\"," +
            "\"瑞安市\",\"慈溪市\",\"义乌市\",\"上虞市\",\"诸暨市\",\"海宁市\",\"桐乡市\",\"兰溪市\",\"龙泉市\",\"建德市\",\"富德市\",\"富阳市\",\"平湖市\"," +
            "\"东阳市\",\"嵊州市\",\"奉化市\",\"临安市\",\"江山市\",\"台湾省\",\"台北市\",\"台南市\",\"台中市\",\"高雄市\",\"桃源市\",\"广东省\",\"广州市\"," +
            "\"深圳市\",\"珠海市\",\"汕头市\",\"佛山市\",\"韶关市\",\"湛江市\",\"肇庆市\",\"江门市\",\"茂名市\",\"惠州市\",\"梅州市\",\"汕尾市\",\"河源市\"," +
            "\"阳江市\",\"清远市\",\"东莞市\",\"中山市\",\"潮州市\",\"揭阳市\",\"云浮市\",\"广西壮族自治区\",\"南宁市\",\"贺州市\",\"玉林市\",\"桂林市\"," +
            "\"柳州市\",\"梧州市\",\"北海市\",\"钦州市\",\"百色市\",\"防城港市\",\"贵港市\",\"河池市\",\"崇左市\",\"来宾市\",\"东兴市\",\"桂平市\"," +
            "\"北流市\",\"岑溪市\",\"合山市\",\"凭祥市\",\"宜州市\",\"内蒙古自治区\",\"呼和浩特市\",\"呼伦贝尔市\",\"赤峰市\",\"扎兰屯市\",\"鄂尔多斯市\"," +
            "\"乌兰察布市\",\"巴彦淖尔市\",\"二连浩特市\",\"霍林郭勒市\",\"包头市\",\"乌海市\",\"阿尔山市\",\"乌兰浩特市\",\"锡林浩特市\",\"根河市\",\"满洲里市\"," +
            "\"额尔古纳市\",\"牙克石市\",\"临河市\",\"丰镇市\",\"通辽市\",\"宁夏回族自治区\",\"银川市\",\"固原市\",\"石嘴山市\",\"青铜峡市\",\"中卫市\"," +
            "\"吴忠市\",\"灵武市\",\"西藏自治区\",\"拉萨市\",\"那曲市\",\"山南市\",\"林芝市\",\"昌都市\",\"阿里地区日喀则市\",\"新疆维吾尔自治区\",\"乌鲁木齐市\"," +
            "\"石河子市\",\"喀什市\",\"阿勒泰市\",\"阜康市\",\"库尔勒市\",\"阿克苏市\",\"阿拉尔市\",\"哈密市\",\"克拉玛依市\",\"昌吉市\",\"奎屯市\",\"米泉市\"," +
            "\"和田市\",\"塔城市\"";
    /**
     * @param start 开始大小
     * @param size  多少个
     * @return 集合
     */
    public static List<User> getUser(int start, int size) {
        int length = start + size;
        List<User> list = new ArrayList<>();
        for (int i = start; i < length; i++) {
            User user = new User();
            user.setSex(i % 2 == 0 ? "男" : "女");
            user.setName("张三" + i);
            user.setAge(i);
            user.setId(i + "");
            list.add(user);
        }
        return list;
    }

    /**
     * @param field 前缀
     * @param start 开始大小
     * @param size  多少个
     * @return 集合
     */
    public static List<User> getUserField(String field,int start, int size) {
        int length = start + size;
        List<User> list = new ArrayList<>();
        for (int i = start; i < length; i++) {
            User user = new User();
            user.setSex(i % 2 == 0 ? "男" : "女");
            user.setName(field + i);
            user.setAge(i);
            user.setId(i + "");
            list.add(user);
        }
        return list;
    }
    public static String[] getCity(){
        String[] split = cityOnly.split(",");
        return split;
    }

    public static List<User> getCityData(String[] city) {
        List<User> list = new ArrayList<>();
        for (int i = 0; i < city.length; i++) {
            User user = new User();
            user.setSex(i % 2 == 0 ? "男" : "女");
            user.setName(city[i].replaceAll("\"",""));
            user.setAge(i);
            user.setId(i + "");
            list.add(user);
        }
        return list;
    }
}
